app/Controllers/PengirimanUangController.php

SELECT *
FROM `pengiriman_uang`
---
    public function index()
    {
        $pengirimanUangModel = new PengirimanUangModel();
        $bagianDprdModel = new BagianDprdModel();
        $bagianDprd = $bagianDprdModel->getNamaBagian();
        $data['pengiriman_uang'] = $pengirimanUangModel->findAll();

DELETE FROM `pengiriman_uang`
WHERE `id` IN ('9')
---
    public function delete($id)
    {
        $pengirimanUangModel = new PengirimanUangModel();
        $pengirimanUangModel->delete($id);