app/Models/BagianDPRDModel.php

    public function getBagianDPRD()
    {
        return $this->findAll();
---
SELECT *
FROM `bagian_dprd`

    public function getNamaBagian()
    {
        return $this->select('nama_bagian')->findAll();
---
SELECT `nama_bagian`
FROM `bagian_dprd`