app/Models/LaporanPerjalananDinasModel.php

SELECT COUNT(laporan_perjalanan_dinas.id) as jum
FROM `laporan_perjalanan_dinas`
WHERE `laporan_perjalanan_dinas`.`status` = 2
---
    public function getLaporanStatus($status)
    {
        return $this->db->table($this->table)
            ->select('COUNT(laporan_perjalanan_dinas.id) as jum')
            ->where("laporan_perjalanan_dinas.status", $status)
            ->get()
            ->getRowArray();