app/Models/NamaPelaksanaModel.php

    public function getAllNamaPelaksana()
    {
        return $this->findAll();
---
SELECT *
FROM `nama_pelaksana`