app/Models/PengirimanUangModel.php

    public function insertPengirimanUang($data)
    {
        $builder = $this->otherdb->table("kas");

        $data_kas = [

            "kredit"            => $data["jumlah_uang"],
            "bagian_dprd_id"    => $data["bagian_dprd_id"],
            "keterangan"        => "Anggaran masuk",
            "rekening_bank"     => 0,

        ];

        $builder->insert($data_kas);
        $last_id = $this->otherdb->insertID();

        $data["kas_id"] = $last_id;

        $this->insert($data);
---
INSERT INTO `pengiriman_uang` (`bagian_dprd_id`, `jumlah_uang`, `tanggal_pengiriman`, `keterangan`, `user_input`, `user_edit`, `kas_id`) VALUES ('11', '1000000000', '2024-02-26', 'ada', NULL, NULL, 12)